{
    "basics": {
      "name": "Elvis Enrique Chen Qiu",
      "label": "International student at Huazhong University of Science and Technology",
      "image": "https://avatars.githubusercontent.com/u/182654114?v=4",
      "email": "3659397757@qq.com",
      "phone": "(912) 555-4321",
      "url": "https://github.com/Echeq",
      "summary": "International student originally from Panama with experience in web design and technical translation. Although I have worked on web design projects and collaborated on translations to optimize communication between cultures, my true passion lies in creating software to solve practical problems and in video game development. Currently, I am exploring desktop application development and have worked on a video game project, which has allowed me to learn about programming logic, problem-solving, and interactive storytelling. I enjoy tackling technical challenges and optimizing solutions to make them scalable and efficient. I am always looking for opportunities to learn, collaborate, and contribute to innovative projects that allow me to continue growing as a developer. ",
      "location": {
        "address": "Huazhong University of Science and Technology",
        "city": "Wuhan",
        "country": "China"
      },
      "profiles": [{
        "network": "Github",
        "username": "Echeq",
        "url": "https://github.com/Echeq"
      }]
    },
    "work": [
    {
      "name": "Auvimax Digital",
      "position": "Web Administrator",
      "startDate": "2019",
      "endDate": "2022",
      "summary": "Responsible for uploading new products to the website, optimizing product listings for searchability and customer engagement."
    },
    {
      "name": "Clinica Condado - 惠民诊所",
      "position": "Freelance Web Developer & Translation to Chinese",
      "startDate": "2023",
      "endDate": "2025",
      "summary": "Collaborated closely with the client to understand their requirements and deliver a solution that met both technical and business needs."
    }],
    "education": [{
      "institution": "Colegio Agustiniano Nuestra Señora del Buen Consejo",
      "area": "Elementary School and Highschool",
      "startDate": "2009",
      "endDate": "2020"
    },
    {
    "institution": "Priceton Academy",
      "area": "Finance & English",
      "startDate": "2020",
      "endDate": "2022"
    },
    {
      "institution": "The Technological University of Panama",
        "area": "Software Engineering",
        "startDate": "2022",
        "endDate": "2022"
    },
    {
      "institution": "China University of Geosciences",
          "area": "Chinese Language",
          "startDate": "2022",
          "endDate": "2023"
      },
    {
      "institution": "Huazhong University of Science and Technology",
          "area": "Software Engineering",
          "startDate": "2023",
          "endDate": null
        }
  ],
    "skills": [{
      "name": "C Language"
    },
    {
      "name": "Python"
    },
    {
      "name": "Java"
    },
    {
      "name": "Linux Systems"
    },
    {
      "name": "Godot"
    },
    {
      "name": "Git"
    },
    {
      "name": "SQL"
    },
    {
      "name": "Flask"
    },
    {
      "name": "FastAPI"
    }],
    "projects": [
    {
      "name": "Beat-It",
      "isActive": false,
      "description": "2D rhythm game where the player controls a character and must hit markers that come from above and below. The game features different modes: a single-player mode where the player can upload their own music to convert it and adjust the difficulty to create a challenging experience, a two-player multiplayer mode, and a boss mode. Currently, the game is no longer being updated.",
      "highlights": [
        "Project Manager & Lead Programmer"
      ],
      "url": "https://github.com/MrJunnest/Beat-IT"
    },
    {
      "name": "Social Engineering Security Auditor Software",
      "isActive": false,
      "description": "It is a cybersecurity auditing tool designed to identify vulnerabilities in systems through controlled social engineering simulations. Its implementation involves sending an .exe file, which can be obfuscated to make its analysis more difficult. If the audit is successful, the information can be sent to Telegram or Discord. This tool is for private use only and is no longer supported.",
      "highlights": [
        "Integration Developer"
      ],
      "url": ""
    },
    {
      "name": "Malware Analysis Sandbox Laboratory",
      "isActive": true,
      "description": "An open-source educational tool designed to simulate and analyze the behavior of malware in a controlled environment. The software provides a user-friendly interface where users can select specific functionalities to simulate a malware-like behavior. Upon execution, the program displays a clear and non-intrusive notification on the target machine's screen (e.g., a label in the top-right corner) indicating that the system is part of a simulated infection for educational purposes. This ensures safe and ethical usage while providing valuable insights into how malware operates.",
      "highlights": [
        "Software Developer"
      ],
      "url": ""
    }],
    "languages": [{
      "name": "English"
    },
    {
      "name": "Spanish"
    },
    {
      "name": "Chinese"
    }]
  }